aaravb.chrome-extension-developer-tools
amiralizadeh9480.cpp-helper
angular.ng-template
anthropic.claude-code
augustocdias.tasks-shell-input
bmewburn.vscode-intelephense-client
bradlc.vscode-tailwindcss
coder.coder-remote
donjayamanne.githistory
drblury.protobuf-vsc
esbenp.prettier-vscode
franneck94.c-cpp-runner
github.vscode-github-actions
liaronce.gml-support
marus25.cortex-debug
mcu-debug.debug-tracker-vscode
mcu-debug.memory-view
mcu-debug.peripheral-viewer
mcu-debug.rtos-views
meteor-toolbox.meteor-toolbox
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
ms-vscode.remote-explorer
qwtel.sqlite-viewer
rifi2k.format-html-in-php
rioj7.command-variable
rust-lang.rust-analyzer
twxs.cmake
vadimcn.vscode-lldb
vscode-icons-team.vscode-icons
yrm.type-challenges
zixuanwang.linkerscript
